print( """КМ-94 Цахло Едуард Володимирович
Варіант 22 Завдання 1

Дан прямокутник розміром 647 x 170. Скільки квадратів зі стороною 30 можна вирізати з нього?\n""" )

result = ( 647 // 30 ) * ( 170 // 30 )

print( '( 647 // 30 ) * ( 170 // 30 ) = {} квадратів'.format( result ) )